#!/bin/bash

# 设置遇到错误立刻停止运行
set -e 

echo -e "\033[34m[1/4]\033[0m 准备清理旧的编译缓存..."
if [ -d "build" ]; then
    rm -rf build
    echo "--> 已删除旧的 build 目录。"
fi

echo -e "\033[34m[2/4]\033[0m 正在创建新的 build 目录..."
mkdir build
cd build

echo -e "\033[34m[3/4]\033[0m 正在执行 cmake 构建项目配置..."
cmake ..

echo -e "\033[34m[4/4]\033[0m 正在执行 make 编译代码..."
# 这里的 make -j4 表示使用 4 个 CPU 核心同时编译，速度会快很多！
make -j4

# 回到项目根目录
cd ..

# 打印绿色的成功提示语
echo -e "\n\033[32m====================================================\033[0m"
echo -e "\033[32m🎉 编译成功！所有的可执行文件已经生成在 bin/ 目录下。\033[0m"
echo -e "\033[32m====================================================\033[0m\n"